#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include <float.h>
#pragma pack(2)
double PI = 3.14159265359;
// 定義DCT dimension
#define DCT_H 8
#define DCT_W 8

// 建立BMP header結構
typedef struct Bmpheader
{
    char identifier[2];      // 0x0000
    unsigned int filesize;   // 0x0002
    unsigned short reserved; // 0x0006
    unsigned short reserved2;
    unsigned int bitmap_dataoffset; // 0x000A
    unsigned int bitmap_headersize; // 0x000E
    unsigned int width;             // 0x0012
    unsigned int height;            // 0x0016
    unsigned short planes;          // 0x001A
    unsigned short bits_perpixel;   // 0x001C
    unsigned int compression;       // 0x001E
    unsigned int bitmap_datasize;   // 0x0022
    unsigned int hresolution;       // 0x0026
    unsigned int vresolution;       // 0x002A
    unsigned int usedcolors;        // 0x002E
    unsigned int importantcolors;   // 0x0032
} Bitmap;

// 建立RGB結構
typedef struct RGB
{
    unsigned char R;
    unsigned char G;
    unsigned char B;
} ImgRGB;

// 建立YCbCr結構
typedef struct YCbCr
{
    double Y;
    double Cb;
    double Cr;
} ImgYCbCr;

// 建立2DCT結構
typedef struct DCTArray
{
    double ***Y;
    double ***Cb;
    double ***Cr;
} DCTArray;

// 建立2DCT 基底結構
typedef struct BasisVector
{
    double Y;
    double Cb;
    double Cr;
} BasisVector;

// 建立複製2DCT資料結構
typedef struct DCTCoefficients
{
    double ***Y;
    double ***Cb;
    double ***Cr;
} DCTCoefficients;

// 定義用於存儲 RLE 數據的結構
typedef struct
{
    int size;
    int *data;
} RLEData;

// 定義 Y, Cb, Cr 的量化矩陣
int Q_Y[8][8] = {
    {16, 11, 10, 16, 24, 40, 51, 61},
    {12, 12, 14, 19, 26, 58, 60, 55},
    {14, 13, 16, 24, 40, 57, 69, 56},
    {14, 17, 22, 29, 51, 87, 80, 62},
    {18, 22, 37, 56, 68, 109, 103, 77},
    {24, 35, 55, 64, 81, 104, 113, 92},
